{
    "content": [
        {
            "name": "Welcome to Chemistry: Concept Development and Application",
            "date": "Mon 4 Mar 2013 6:01 PM PST -0800",
            "description": "Welcome to “Chemistry: Concept Development and Application”! Thank you for your interest in this course, and I hope you’ll both enjoy and benefit from the materials which will be presented.\n\rThe course will closely follow my book “Concept Development Studies in Chemistry”, the 2012 edition. This book is available free on-line, or may be downloaded in either pdf format or e-reader format also for free. The book is available on Rice’s Connexions project site at http://cnx.org/content/col11444/latest/. You can also order a printed copy of the book at a small price directly from this site by clicking on “Order printed collection” on the home page. I encourage you to get a copy in one of these formats and begin reading in advance of the lectures each week. You’ll want to refer back to the book frequently. You will also want to get a General Chemistry text book for supplementary material. At this time, I am not recommending any particular books. There are many very good texts available, so you should borrow one if you can or purchase a used book if need be. At Rice, we have recently used McMurray and Fay’s “Chemistry”, McQuarrie, Rock and Gallogly’s “General Chemistry, and Brown, LeMay and Bursten’s “Chemistry: The Central Science.” Feel free to use any of these or any of the other readily available texts for reference.\n\rWe will be giving quizzes at the end of each section of this class, short multiple choice tests to review the material. You should take these quizzes with your notes, books, and lecture videos closed, so that you are challenged to retain the material.\n\rGood luck with the course and let us know how it is going!"
        },
        {
            "name": "The first week of lectures",
            "date": "Tue 5 Mar 2013 3:29 PM PST -0800",
            "description": "The long awaited moment is here, we are excited that the course site is now open!\n\rIn the first week of lectures, we will see our first example of the Concept Development Study approach to Chemistry. You may recall from the introduction that the CDS approach begins with experimental observations and follows scientific reasoning to the development of each key concept. Our first study is the development of the theory that all matter consists of atoms and molecules. The experimental evidence we will analyze and the logic we will follow are both based on the same observations which were used 200 years ago in the original development of the atomic molecular theory. Perhaps surprisingly, we will be able to demonstrate the existence of atoms and molecules and even to determine properties of these atoms and molecules without directly observing them. This is a great example of scientific reasoning, and once you have followed through that reasoning, you will have developed your own scientific reasoning skill.\n\rI hope you enjoy the lectures!\n\rJSH"
        }
    ]
}
