{
        "imageUrl": "https://www.edx.org/static/content-berkeley-cs169x~2013_Spring/images/course_image.jpg", 
        "name": "Логические элементы", 
        "university": "НИУ ИТМО", 
        "beginDate": "3 апреля 2013 г.",
        "endDate": "24 мая 2013 г.",
        "effort": "5 часов в неделю",
        "prerequisites": true,
        "description": "CS169.1x teaches the fundamentals for engineering long-lasting software using highly-productive Agile techniques to develop Software as a Service (SaaS) using Ruby on Rails. Students will understand the new challenges and opportunities of SaaS versus shrink-wrapped software. They will understand and apply fundamental programming techniques to the design, development, testing, and public cloud deployment of a simple SaaS application. Students will use best-of-breed tools that support modern development techniques including behavior-driven design, user stories, test-driven development, velocity, and pair programming. Students will learn how modern programming language features like metaprogramming and reflection can improve productivity and code maintainability.\n\rStudents will work individually on weekly coding projects. Those who successfully complete each assignment and earn a passing grade will get an honor code certificate from BerkeleyX.",
        "staff": [
        {
                "photoUrl": "http://www.ifmo.ru/images/person/small/p220.jpg", 
                "name": "Лямин Андрей Владимирович", 
                "description": "Кандидат технических наук, профессор кафедры компьютерных образовательнях технологий НИУ ИТМО. Область научных интересов — автоматизированные системы обработки информации и управления в науке и образовании. Является автором более 110 научных и научно-методических трудов. В 2009 году награжден премией Правительства Санкт-Петербурга за выдающиеся достижения в области высшего и среднего профессионального образования, номинация «Развитие инновационной деятельности в образовательном учреждении»."
        }
        ],
        "parts": [
            {
                "id": "about",
                "name": "Содержание"
            },
            {
                "id": "news",
                "name": "Объявления"
            },
            {
                "id": "lectures",
                "name": "Лекции"
            },
            {
                "id": "work",
                "name": "Практикум"
            },
            {
                "id": "exam",
                "name": "Контроль"
            },
            {
                "id": "forum",
                "name": "Форум"
            },
            {
                "id": "progress",
                "name": "Успеваемость"
            }
        ]
}
